* [Day 1] Sonar Sweep
** Org mode :noexport:
   This is written in literate programming with org-babel and ruby. Reading this file won't help you to understand quickly. Please refers to the generated markdown file 
** Increment counter
#+NAME: increment_counter
#+BEGIN_SRC ruby :session  
  def increment_counter(array)
   count = 0
   array.each_cons(2) do |first, second|
     count += 1 if second > first
   end
   count
  end
#+END_SRC

#+RESULTS: increment_counter
: :increment_counter

** Part One
*** Test data
   
    #+BEGIN_SRC ruby :exports both  :noweb yes
      <<increment_counter>>
      input = File.readlines("test.txt").map(&:to_i)      
      "Result: #{increment_counter(input)}"
    #+END_SRC

    #+RESULTS:
    : Result: 7

*** Input data 
    #+BEGIN_SRC ruby :exports both :noweb yes
      <<increment_counter>>
      input = File.readlines("input.txt").map(&:to_i)      
      "Result: #{increment_counter(input)}"
    #+END_SRC

    #+RESULTS:
    : Result: 1226
    
** Part Two
*** Test data
   #+BEGIN_SRC ruby :exports both :noweb yes
     <<increment_counter>>
     sum_array = []
     File.readlines("test.txt").map(&:to_i).each_cons(3) do |first_num, second_num, third_num|
        sum_array << first_num + second_num + third_num
     end
     "Result: #{increment_counter(sum_array)}"
   #+END_SRC

   #+RESULTS:
   : Result: 5
*** Input data   
   #+BEGIN_SRC ruby :exports both :noweb yes
     <<increment_counter>>
     sum_array = []
     File.readlines("input.txt").map(&:to_i).each_cons(3) do |first_num, second_num, third_num|
        sum_array << first_num + second_num + third_num
     end     
     "Result: #{increment_counter(sum_array)}"
   #+END_SRC

   #+RESULTS:
   : Result: 1252
